tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# install scripts we want
brew 'ag'
brew 'bartender'
brew 'boost'
brew 'cmake'
brew 'coreutils'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'hdf5'
brew 'htop'
brew 'htslib'
brew 'node'
brew 'python3'
brew 'samtools'
brew 'snakemake'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# get brew cask for apps
tap 'caskroom/cask'

# install the apps we want
cask 'dropbox'
cask 'macvim'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']
